//SGCBCTR  JOB (SIGEC,CONTR),'CONTRATOS ISOLADO',
//         CLASS=A,MSGCLASS=X,MSGLEVEL=(1,1),
//         NOTIFY=&SYSUID,REGION=0M,TIME=60
//*
//*----------------------------------------------------------------*
//* SISTEMA .: SIGEC                                              *
//* JCL .....: SGCBCTR  - EXECUCAO ISOLADA DE CONTRATOS            *
//* FUNCAO ..: RODA SGCB0020 (VALIDACAO) E, EM SEGUIDA, SGCB0040   *
//*            (VALIDACAO DE PAGAMENTOS QUANDO REFERENCIA CONTRATO)*
//* USO .....: REPROCESSAMENTO PARCIAL, INDEPENDENTE DA JANELA     *
//*            DIARIA. NAO SUBSTITUI SGCBDIA.                      *
//*----------------------------------------------------------------*
//*
//JOBLIB   DD  DSN=SIGEC.LAB.LOADLIB,DISP=SHR
//*
//*-------- STEP020 - VALIDACAO DE CONTRATOS ----------------------
//STEP020  EXEC PGM=SGCB0020
//STEPLIB  DD  DSN=SIGEC.LAB.LOADLIB,DISP=SHR
//SYSPRINT DD  SYSOUT=*
//SYSOUT   DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=*
//CTRIN    DD  DSN=SIGEC.LAB.IN.SGLCTRIN(0),DISP=SHR
//CTRVL    DD  DSN=SIGEC.LAB.OUT.SGLCTRVL(+1),
//             DISP=(NEW,CATLG,DELETE),
//             SPACE=(CYL,(20,10)),
//             DCB=(RECFM=FB,LRECL=220,BLKSIZE=27720)
//CTRRE    DD  DSN=SIGEC.LAB.OUT.SGLCTRRE(+1),
//             DISP=(NEW,CATLG,DELETE),
//             SPACE=(CYL,(10,5)),
//             DCB=(RECFM=FB,LRECL=260,BLKSIZE=27820)
//ESTAT    DD  DSN=SIGEC.LAB.OPS.SGLESTAT,DISP=MOD
//*
//*-------- STEP040 - VALIDACAO DE PAGAMENTOS (COND=(8,LT)) -------
//STEP040  EXEC PGM=SGCB0040,COND=(8,LT,STEP020)
//STEPLIB  DD  DSN=SIGEC.LAB.LOADLIB,DISP=SHR
//SYSPRINT DD  SYSOUT=*
//SYSOUT   DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=*
//PAGIN    DD  DSN=SIGEC.LAB.IN.SGLPAGIN(0),DISP=SHR
//PAGVL    DD  DSN=SIGEC.LAB.OUT.SGLPAGVL(+1),
//             DISP=(NEW,CATLG,DELETE),
//             SPACE=(CYL,(20,10)),
//             DCB=(RECFM=FB,LRECL=140,BLKSIZE=27860)
//PAGRE    DD  DSN=SIGEC.LAB.OUT.SGLPAGRE(+1),
//             DISP=(NEW,CATLG,DELETE),
//             SPACE=(CYL,(10,5)),
//             DCB=(RECFM=FB,LRECL=180,BLKSIZE=27720)
//ESTAT    DD  DSN=SIGEC.LAB.OPS.SGLESTAT,DISP=MOD
//
