//SGCBPAG  JOB (SIGEC,PAGTOS),'PAGAMENTOS ISOLADO',
//         CLASS=A,MSGCLASS=X,MSGLEVEL=(1,1),
//         NOTIFY=&SYSUID,REGION=0M,TIME=90
//*
//*----------------------------------------------------------------*
//* SISTEMA .: SIGEC                                              *
//* JCL .....: SGCBPAG  - EXECUCAO ISOLADA DE PAGAMENTOS/ENCARGOS  *
//* FUNCAO ..: RODA SGCB0030 (CARGA CONTRATOS -> DB2) SEGUIDO DE   *
//*            SGCB0070 (CALCULO DE ENCARGOS). USADO PARA REBUILD  *
//*            DA POSICAO DIARIA QUANDO SGCBDIA ABORTA APOS 0020.  *
//* USO .....: OPERADOR + TIME DE APLICACAO. NAO E SUBSTITUTO      *
//*            OFICIAL DA JANELA DIARIA.                           *
//*----------------------------------------------------------------*
//*
//JOBLIB   DD  DSN=SIGEC.LAB.LOADLIB,DISP=SHR
//         DD  DSN=DB2P.DB2.SDSNLOAD,DISP=SHR
//*
//*-------- STEP030 - CARGA DE CONTRATOS VALIDOS EM DB2 -----------
//STEP030  EXEC PGM=IKJEFT01,DYNAMNBR=20
//STEPLIB  DD  DSN=SIGEC.LAB.LOADLIB,DISP=SHR
//         DD  DSN=DB2P.DB2.SDSNLOAD,DISP=SHR
//SYSTSPRT DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=*
//SYSTSIN  DD  *
  DSN SYSTEM(DB2P)
  RUN  PROGRAM(SGCB0030) PLAN(SIGECPLN) -
       LIB('SIGEC.LAB.LOADLIB')
  END
//CTRVL    DD  DSN=SIGEC.LAB.OUT.SGLCTRVL(0),DISP=SHR
//CTRCG    DD  DSN=SIGEC.LAB.OUT.SGLCTRCG(+1),
//             DISP=(NEW,CATLG,DELETE),
//             SPACE=(CYL,(20,10)),
//             DCB=(RECFM=FB,LRECL=220,BLKSIZE=27720)
//DB2RE    DD  DSN=SIGEC.LAB.OUT.SGLDB2RE(+1),
//             DISP=(NEW,CATLG,DELETE),
//             SPACE=(CYL,(5,5)),
//             DCB=(RECFM=FB,LRECL=200,BLKSIZE=27800)
//*
//*-------- STEP070 - CALCULO DE ENCARGOS (COND=(8,LT)) -----------
//STEP070  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(8,LT,STEP030)
//STEPLIB  DD  DSN=SIGEC.LAB.LOADLIB,DISP=SHR
//         DD  DSN=DB2P.DB2.SDSNLOAD,DISP=SHR
//SYSTSPRT DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=*
//SYSTSIN  DD  *
  DSN SYSTEM(DB2P)
  RUN  PROGRAM(SGCB0070) PLAN(SIGECPLN) -
       LIB('SIGEC.LAB.LOADLIB')
  END
//ENCAR    DD  DSN=SIGEC.LAB.OUT.SGLENCAR(+1),
//             DISP=(NEW,CATLG,DELETE),
//             SPACE=(CYL,(20,10)),
//             DCB=(RECFM=FB,LRECL=200,BLKSIZE=27800)
//SGLERROS DD  DSN=SIGEC.LAB.OPS.SGLERROS,DISP=MOD
//
