//SGCBLOAD JOB (SIGEC,LOAD),'CARGA INICIAL DB2',
//         CLASS=A,MSGCLASS=X,MSGLEVEL=(1,1),
//         NOTIFY=&SYSUID,REGION=0M,TIME=60
//*
//*----------------------------------------------------------------*
//* SISTEMA .: SIGEC                                              *
//* JCL .....: SGCBLOAD - CARGA INICIAL DE DADOS DE REFERENCIA     *
//* FUNCAO ..: EXECUTA SCRIPTS SQL EM DB2 (SUBSISTEMA DB2P) SOBRE  *
//*            O SCHEMA SGCDB APONTANDO PARA OS ARQUIVOS EM        *
//*            SIGEC.LAB.SQL.CARGA (VER db2/carga/*.sql).          *
//* USO .....: PRIMEIRA CARGA APOS DDL (STEP DDL EM SGCBDDL).      *
//*            RERUN EXIGE LIMPEZA PREVIA VIA SGCBLIMP.            *
//*----------------------------------------------------------------*
//*
//JOBLIB   DD  DSN=DB2P.DB2.SDSNEXIT,DISP=SHR
//         DD  DSN=DB2P.DB2.SDSNLOAD,DISP=SHR
//*
//*-------- 1) VALIDA ACESSO AO PLANO -----------------------------
//STEP010  EXEC PGM=IKJEFT01,DYNAMNBR=20
//STEPLIB  DD  DSN=DB2P.DB2.SDSNLOAD,DISP=SHR
//SYSTSPRT DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=*
//SYSTSIN  DD  *
  DSN SYSTEM(DB2P)
  RUN  PROGRAM(DSNTEP2) PLAN(SIGECPLN) -
       LIB('DB2P.DB2.RUNLIB.LOAD')
  END
//SYSIN    DD  *
  SELECT COUNT(*) FROM SGCDB.SG_CLIENTE WITH UR;
/*
//*
//*-------- 2) CARGA DE PARAMETROS --------------------------------
//STEP020  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT,STEP010)
//STEPLIB  DD  DSN=DB2P.DB2.SDSNLOAD,DISP=SHR
//SYSTSPRT DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=*
//SYSTSIN  DD  *
  DSN SYSTEM(DB2P)
  RUN  PROGRAM(DSNTEP2) PLAN(SIGECPLN)
  END
//SYSIN    DD  DSN=SIGEC.LAB.SQL.CARGA(PARAM01),DISP=SHR
//*
//*-------- 3) CARGA DE CLIENTES ----------------------------------
//STEP030  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT)
//STEPLIB  DD  DSN=DB2P.DB2.SDSNLOAD,DISP=SHR
//SYSTSPRT DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//SYSTSIN  DD  *
  DSN SYSTEM(DB2P)
  RUN  PROGRAM(DSNTEP2) PLAN(SIGECPLN)
  END
//SYSIN    DD  DSN=SIGEC.LAB.SQL.CARGA(CLIENT02),DISP=SHR
//*
//*-------- 4) CARGA DE CONTRATOS ---------------------------------
//STEP040  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT)
//STEPLIB  DD  DSN=DB2P.DB2.SDSNLOAD,DISP=SHR
//SYSTSPRT DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//SYSTSIN  DD  *
  DSN SYSTEM(DB2P)
  RUN  PROGRAM(DSNTEP2) PLAN(SIGECPLN)
  END
//SYSIN    DD  DSN=SIGEC.LAB.SQL.CARGA(CONTR03),DISP=SHR
//*
//*-------- 5) CARGA DE PARCELAS + PAGAMENTOS ---------------------
//STEP050  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT)
//STEPLIB  DD  DSN=DB2P.DB2.SDSNLOAD,DISP=SHR
//SYSTSPRT DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//SYSTSIN  DD  *
  DSN SYSTEM(DB2P)
  RUN  PROGRAM(DSNTEP2) PLAN(SIGECPLN)
  END
//SYSIN    DD  DSN=SIGEC.LAB.SQL.CARGA(PARC04),DISP=SHR
//         DD  DSN=SIGEC.LAB.SQL.CARGA(PAG05),DISP=SHR
//         DD  DSN=SIGEC.LAB.SQL.CARGA(COMMIT99),DISP=SHR
//
