//SGCBINA  JOB (SIGEC,INAD),'INADIMPLENCIA',
//         CLASS=A,MSGCLASS=X,MSGLEVEL=(1,1),
//         NOTIFY=&SYSUID,REGION=0M,TIME=90
//*
//*----------------------------------------------------------------*
//* SISTEMA .: SIGEC                                              *
//* JCL .....: SGCBINA  - EXECUCAO ISOLADA DE INADIMPLENCIA        *
//* FUNCAO ..: RODA SGCB0130 (DETECCAO + CLASSIFICACAO) SEGUIDO DE *
//*            SGCB0150 (ATUALIZACAO VSAM SGVCOBRA).               *
//* USO .....: REROLL DIARIO DE POSICAO DE RISCO QUANDO O STEP     *
//*            EQUIVALENTE EM SGCBDIA PRECISA SER REPROCESSADO.    *
//*----------------------------------------------------------------*
//*
//JOBLIB   DD  DSN=SIGEC.LAB.LOADLIB,DISP=SHR
//         DD  DSN=DB2P.DB2.SDSNLOAD,DISP=SHR
//*
//*-------- STEP130 - DETECCAO/CLASSIFICACAO ----------------------
//STEP130  EXEC PGM=IKJEFT01,DYNAMNBR=20
//STEPLIB  DD  DSN=SIGEC.LAB.LOADLIB,DISP=SHR
//         DD  DSN=DB2P.DB2.SDSNLOAD,DISP=SHR
//SYSTSPRT DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//SYSTSIN  DD  *
  DSN SYSTEM(DB2P)
  RUN  PROGRAM(SGCB0130) PLAN(SIGECPLN) -
       LIB('SIGEC.LAB.LOADLIB')
  END
//SGLINADI DD  DSN=SIGEC.LAB.OUT.SGLINADI(+1),
//             DISP=(NEW,CATLG,DELETE),
//             SPACE=(CYL,(20,10)),
//             DCB=(RECFM=FB,LRECL=200,BLKSIZE=27800)
//SGLPROP  DD  DSN=SIGEC.LAB.OUT.SGLPROP(+1),
//             DISP=(NEW,CATLG,DELETE),
//             SPACE=(CYL,(10,5)),
//             DCB=(RECFM=FB,LRECL=240,BLKSIZE=27600)
//SGLERROS DD  DSN=SIGEC.LAB.OPS.SGLERROS,DISP=MOD
//*
//*-------- STEP150 - ATUALIZACAO VSAM SGVCOBRA (COND=(8,LT)) -----
//STEP150  EXEC PGM=SGCB0150,COND=(8,LT,STEP130)
//STEPLIB  DD  DSN=SIGEC.LAB.LOADLIB,DISP=SHR
//SYSPRINT DD  SYSOUT=*
//SYSOUT   DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=*
//SGVCOBRA DD  DSN=SIGEC.LAB.VSAM.SGVCOBRA,DISP=SHR
//SGLINADI DD  DSN=SIGEC.LAB.OUT.SGLINADI(0),DISP=SHR
//SGLAUDVS DD  DSN=SIGEC.LAB.OUT.SGLAUDVS(+1),
//             DISP=(NEW,CATLG,DELETE),
//             SPACE=(CYL,(10,5)),
//             DCB=(RECFM=FB,LRECL=200,BLKSIZE=27800)
//
